artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_fix2_20260330_125921/cases/lumped_solid/0/jellyRoll/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/jellyRoll";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    jellyRoll_to_shell
    {
        type            zeroGradient;
    }
    jellyRoll_to_cap
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
